[
    {
        "name":"10 Minute Documentary",
        "youtube":"https://youtu.be/bzZp8eJDPyg",
        "Brief":"Project for my Film Production I class.  We had to make a short documentary (defined as 10 minutes or less) with a clear beginning, middle and end on a subject of our choosing.",
        "Description":"I chose to make my documentary about my hometown.  Specifically, its involvement in the Underground Railroad.  However, through my interviews I managed to get a lot of footage and information on this and similar topics, enough to potentially make a much longer documentary later on.",
        "date":"2025-05-05",
        "tags":["Adobe Premiere Pro", "Documentary", "Canon 5D Mark IV", "Adobe After Effects"]
    },
    {
        "name":"Don't Do As Roman! Short Film",
        "youtube":"https://youtu.be/aJlG5fKVypg",
        "Brief":"Group project for my Film Production I class.  Everyone pitched a short film, which we voted for which ones we wanted to work on, and were assigned into groups from there.",
        "Description":"My film wasn't chosen to be produced which meant I was not the director.  Instead I filled a variety of roles like Producer, Assistant Director, Camerawoman, etc.  The film wasn't my personal vision, and I would have approached the storytelling differently, however my job was to fulfill that of the director.  I also fell sick during the bulk of the filming days, and was only there for two of the final scenes.  As part of the group, however, we all got to make our own final edit, which is where I was able to really shine.  I created all the graphics myself in Photoshop and then used After Effects to incorporate them into the final edit.",
        "date":"2025-04-07",
        "tags":["Adobe Premiere Pro", "Short Film", "Canon 5D Mark IV", "Canon EOS Rebel T5i", "Adobe After Effects", "Adobe Audition", "Adobe Photoshop"]
    },
    {
        "name":"Gimme Truth! Documentary",
        "youtube":"https://youtu.be/Xu_fzdZxXD8",
        "Brief":"Project for my Film Production I class.  We were tasked to make a 2 minute documentary that was either 100% true or 100% false, based on the True/False film festival's 'Gimme Truth' competition.",
        "Description":"I used my friend as the subject for my documentary (or mockumentary in this case).  I wanted to make a subtitled film, so I recruited my friend who spoke Polish and made up the fact that she doesn't like pierogi.",
        "date":"2025-02-27",
        "tags":["Adobe Premiere Pro", "Documentary", "Canon 5D Mark IV"]
    },
    {
        "name":"Visual Poem",
        "youtube":"https://youtu.be/c9mVaavVH3g",
        "Brief":"Project for my Intro to Digital Storytelling class.  We had to evoke a specific mood through our imagery and soundscape to match the poem we used as voiceover.  We also had to include either experimental footage or symbolic/metaphoric imagery.",
        "Description":"",
        "date":"2024-04-29",
        "tags":["Adobe Premiere Pro","Canon EOS Rebel T5i","Short Film"]
    },
    {
        "name":"Light and Composition Video",
        "youtube":"https://youtu.be/v7RTL06nGUY",
        "Brief":"Project for my Intro to Digital Storytelling class.  We essentially were told to make our 'reel' by practicing camera and editing techniques, like camera tilts and pans, graphic matching, natural wipes, as well as making everything look pretty with our composition and lighting.",
        "Description":"",
        "date":"2024-03-11",
        "tags":["Adobe Premiere Pro","Canon EOS Rebel T5i"]
    },
    {
        "name":"Light and Composition Video Re-edit to 1minute",
        "youtube":"https://youtu.be/JeoZCPqFqs8",
        "Brief":"As extra editing practice, my professor challenged us to re-edit our Light and Composition Video to be one minute or less.",
        "Description":"",
        "date":"2024-03-17",
        "tags":["Adobe Premiere Pro","Canon EOS Rebel T5i"]
    },
    {
        "name":"Photostory",
        "youtube":"https://youtu.be/7B9ihwmDAWY",
        "Brief":"Project for my Intro to Digital Storytelling class.  We were told to tell a story using only still images and a complete soundscape.  The purpose of this was to practice composition and sound editing.",
        "Description":"",
        "date":"2024-02-19",
        "tags":["Adobe Premiere Pro","Canon EOS Rebel T5i","Short Film"]
    },
    {
        "name":"Animation Practice",
        "youtube":"",
        "Brief":"",
        "Description":"",
        "date":"",
        "tags":["Adobe After Effects", "Adobe Photoshop"]
    },
    {
        "name":"Welcome Video for Incoming 7th Graders",
        "youtube":"https://www.youtube.com/watch?v=Qt9PrIiVRxo",
        "Brief":null,
        "Description":"One of my earliest video editing projects.  I was tasked with editing the footage collected by the class to make one complete video to be showed when the sixth graders came to visit/tour the middle school.",
        "date":"2018-05-14",
        "tags":["Adobe Premiere Pro"]
    }




]